Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Qute is a templating engine developed specifically for Quarkus. Reflection usage is minimized to reduce the size of native images. The API combines both the imperative and the non-blocking reactive style of coding. In development mode, all files located in `src/main/resources/templates` are monitored for changes, and modifications become visible immediately. Furthermore, we aim to detect most template issues at build time. In this guide, you will learn how to easily render templates in your application.
ja_jp: Qute は、Quarkus 専用に開発されたテンプレートエンジンです。 ネイティブイメージのサイズを縮小するために、リフレクションの使用は最小限に抑えられています。 API は、命令型とノンブロッキングリアクティブ型の両方のコーディングスタイルを組み合わせています。 開発モードでは、`src/main/resources/templates` にあるすべてのファイルの変更が監視され、変更はすぐに表示されます。 さらに、ほとんどのテンプレートの問題をビルド時に検出することを目指しています。 このガイドでは、アプリケーションでテンプレートを簡単にレンダリングする方法を説明します。

source: Qute is designed specifically to meet the Quarkus needs, and help you deal with templates, snippets, and partials and render the data from your storage. It is inspired by the most famous template engines, it is fast, type-safe, works in native, and has a lot of nice features.
ja_jp: Qute は Quarkus の要件を満たすように特別に設計されており、テンプレート、スニペット、部分的な処理やストレージからのデータのレンダリングに役立ちます。最も一般的に使用されているテンプレートエンジンにヒントを得たもので、高速、型安全、ネイティブで動作し、多くの優れた機能を備えています。

source: Qute is primarily designed as a Quarkus extension. However. it is possible to use it as a "standalone" library. In this case, some features are not available and some additional configuration is needed.
ja_jp: Quteは、主にQuarkusのエクステンションとして設計されています。しかし、「スタンドアロン」のライブラリとして使用することも可能です。この場合、いくつかの機能は利用できず、いくつかの追加設定が必要となります。

source: Qute is primarily designed as a Quarkus extension. It is possible to use it as a "standalone" library too. However, in such case some features are not available. In general, any feature mentioned under the <<quarkus_integration>> section is missing. Find more information about the limitations and possibilities in the <<standalone>> section.
ja_jp: Qute は、主に Quarkus のエクステンションとして設計されています。 「スタンドアロン」のライブラリーとして使用することも可能です。 しかし、その場合、いくつかの機能は使用できません。 一般的に、 <<quarkus_integration>> のセクションで言及されている機能は使えません。 制限と可能性については、 <<standalone>> セクションに詳細が記載されています。

source: Qute is primarily designed as a Quarkus extension. It is possible to use it as a "standalone" library too. However, in such case some features are not available. In general, any feature mentioned under the xref:quarkus_integration[Quarkus Integration] section is missing. Find more information about the limitations and possibilities in the xref:standalone[Qute Used as a Standalone Library] section.
ja_jp: Quteは、主にQuarkusのエクステンションとして設計されています。スタンドアロンライブラリとして使用することも可能です。しかし、その場合、いくつかの機能は使用できません。一般的に、Quarkusとの xref:quarkus_integration[統合] のセクションで言及されている機能は、全て無くなります。制限と可能性についての詳細は、 xref:standalone[Quteをスタンドアロンライブラリとして使用] のセクションを参照してください。

source: Qute is primarily designed as a Quarkus extension. It is possible to use it as a "standalone" library too. However, in such case some features are not available. In general, any feature mentioned under the <<quarkus_integration>> section is missing. You can find more information about the limitations and possibilities in the <<standalone>> section.
ja_jp: Qute は、主に Quarkus のエクステンションとして設計されています。「スタンドアロン」のライブラリーとして使用することも可能です。しかし、その場合、いくつかの機能は使用できません。一般的に、 <<quarkus_integration>> のセクションで言及されている機能は使えません。制限と可能性については、 <<standalone>> セクションに詳細が記載されています。

source: Qute is primarily designed as a Quarkus extension. It is possible to use it as a "standalone" library too. However, in such case some of the features are not available. In general, any feature mentioned under the <<quarkus_integration>> section is missing. You can find more information about the limitations and possibilities in the <<standalone>> section.
ja_jp: Quteは、主にQuarkusのエクステンションとして設計されています。「スタンドアロン」ライブラリとして使用することも可能です。しかし、その場合、いくつかの機能は利用できません。一般的に、 <<quarkus_integration>> のセクションに記載されている機能は、すべて欠落しています。制限と可能性についての詳細は、 <<standalone>> のセクションを参照してください。

source: Qute templates
ja_jp: Quteテンプレート

source: Qute templates use sections in its templating language to power any logic required when compiling and displaying the resulting document. To support this, the extension’s Qute support populates a completion list with all available Qute sections, along with any parameters they take and a small code snippet of its usage.
ja_jp: Quteのテンプレートは、テンプレート言語のセクションを使用して、コンパイルと表示時に必要なロジックを実行します。これをサポートするために、拡張のQuteサポートは、利用可能なすべてのQuteセクションと、それらが取るパラメータ、およびその使用方法の小さなコードスニペットを補完リストに入力します。

source: Qute templates use sections in its templating language to power any logic required when compiling and displaying the resulting document. To support this, the extension’s Qute support populates a completion list with all available Qute sections, along with any parameters they take and a small code snippet of their usage.
ja_jp: Quteテンプレートは、テンプレート言語のセクションを使用して、結果のドキュメントをコンパイルして表示する際に必要なロジックを実行します。これをサポートするために、エクステンションのQuteサポートは、利用可能なすべてのQuteセクションと、それらが取るパラメータ、およびそれらの使用法の小さなコードスニペットを補完リストに入力します。

source: Qute, our template engine
ja_jp: テンプレートエンジン Qute

source: Qute, our templating engine, also got a lot of love with several new features, such as the ability to cache a section of the template that rarely changes thanks to link:/guides/qute-reference#cached-section[cached sections].
ja_jp: 我々のテンプレートエンジンであるQuteも、いくつかの新機能を搭載し、多くの愛を受けました。例えば、テンプレートのセクションをキャッシュすることで、ほとんど変更されることのないセクションを link:/guides/qute-reference#cached-section[キャッシュ] する機能などです。

source: RAG Data Preparation
ja_jp: RAGデータ準備

source: README: Quarkus documentation
ja_jp: README: Quarkus ドキュメント

source: REST API Event
ja_jp: REST API イベント

source: REST API's are server-driven fixed data responses that cannot be determined by the client. Although the client does not require all the fields the client must retrieve all the data hence `Over-fetching`. A client may also require multiple REST API calls according to the first call (HATEOAS) to retrieve all the data that is required thereby `Under-fetching`.
ja_jp: REST API は、クライアントが決定できないサーバー主導の固定データレスポンスです。クライアントはすべてのフィールドを必要としなくても、クライアントはすべてのデータを取得しなければならないため、 `Over-fetching` です。クライアントはまた、必要とされるすべてのデータを取得するために、最初の呼び出し(HATEOAS)に応じて複数のREST API呼び出しを必要とする場合があり、 `Under-fetching` です。

source: REST APIs are server-driven fixed data responses that cannot be determined by the client. Although the client does not require all the fields the client must retrieve all the data hence `Over-fetching`. A client may also require multiple REST API calls according to the first call (HATEOAS) to retrieve all the data that is required thereby `Under-fetching`.
ja_jp: REST API は、クライアントが決定できないサーバー主導の固定データレスポンスです。クライアントはすべてのフィールドを必要としなくても、クライアントはすべてのデータを取得しなければならないため、 `Over-fetching` です。クライアントはまた、必要とされるすべてのデータを取得するために、最初の呼び出し(HATEOAS)に応じて複数のREST API呼び出しを必要とする場合があり、 `Under-fetching` です。

source: REST Client
ja_jp: RESTクライアント

source: REST Client Reactive allows sending data as multipart forms. This way you can for example send files efficiently.
ja_jp: REST Client Reactive を使用すると、データをマルチパート形式で送信できます。このようにして、たとえばファイルを効率的に送信できます。

source: REST Client Reactive also supports receiving compressed messages using GZIP. You can enable the HTTP compression support by adding the property `quarkus.http.enable-compression=true`. When this feature is enabled and a server returns a response that includes the header `Content-Encoding: gzip`, REST Client Reactive will automatically decode the content and proceed with the message handling.
ja_jp: REST Client Reactiveは、GZIPを使用した圧縮メッセージの受信もサポートしています。HTTP 圧縮サポートを有効にするには、プロパティ `quarkus.http.enable-compression=true` を追加します。この機能が有効で、サーバーがヘッダー `Content-Encoding: gzip` を含む応答を返すと、REST Client Reactive は自動的にコンテンツをデコードし、メッセージ処理を続行します。

source: REST Client Reactive also supports receiving multipart messages. As with sending, to parse a multipart response, you need to create a class that describes the response data, e.g.
ja_jp: REST Client Reactive は、マルチパートメッセージの受信もサポートしています。送信と同様に、マルチパートレスポンスを解析するには、レスポンスデータを記述するクラスを作成する必要があります。

source: REST Client Reactive can log the requests it sends and the responses it receives. To enable logging, add the `quarkus.rest-client.logging.scope` property to your `application.properties` and set it to:
ja_jp: REST Client Reactive は、送信するリクエストと受信する応答をログに記録できます。ロギングを有効にするには、 `quarkus.rest-client.logging.scope` プロパティーを `quarkus.rest-client.logging.scope` に追加し、次のように設定します。

source: REST Client Reactive is logging the traffic with level DEBUG and does not alter logger properties. You may need to adjust your logger configuration to use this feature.
ja_jp: REST Client Reactive は、レベル DEBUG でトラフィックをログに記録しており、ロガーのプロパティーを変更しません。この機能を使用するには、ロガー設定を調整する必要がある場合があります。

source: REST Client Reactive needs to know the classes used as multipart return types upfront. If you have an interface method that produces `multipart/form-data`, the return type will be discovered automatically. However, if you intend to use the `ClientBuilder` API to parse a response as multipart, you need to annotate your DTO class with `@MultipartForm`.
ja_jp: REST Client Reactive は、マルチパートリターンタイプとして使用されるクラスを事前に知っている必要があります。 `multipart/form-data` を生成するインターフェイスメソッドがある場合、戻り型は自動的に検出されます。ただし、 `ClientBuilder` API を使用して応答をマルチパートとして解析する場合は、DTO クラスに `@MultipartForm` のアノテーションを付ける必要があります。

source: REST Client Reactive support multipart messages.
ja_jp: REST Client Reactive はマルチパートメッセージをサポートします。

source: REST Client Reactive supports sending requests through a proxy. It honors the JVM settings for it but also allows to specify both:
ja_jp: REST Client Reactive は、プロキシーを介したリクエストの送信をサポートしています。JVM 設定を尊重しますが、次の両方を指定することもできます。

source: REST Client allows sending data as multipart forms. This way you can for example send files efficiently.
ja_jp: REST Client を使用すると、データをマルチパートフォームで送信できます。このようにして、たとえば、 ファイルを効率的に送信できます。

source: REST Client also supports receiving compressed messages using GZIP and can be enabled via configuration. When this feature is enabled and a server returns a response that includes the header `Content-Encoding: gzip`, REST Client will automatically decode the content and proceed with the message handling.
ja_jp: REST Client は GZIP を使用した圧縮メッセージの受信もサポートしており、設定で有効にすることができます。 この機能が有効で、サーバがヘッダ `Content-Encoding: gzip` を含む応答を返すと、REST Client は自動的にコンテンツをデコードし、メッセージの処理を進めます。

source: REST Client also supports receiving compressed messages using GZIP. You can enable the HTTP compression support by adding the property `quarkus.http.enable-compression=true`. When this feature is enabled and a server returns a response that includes the header `Content-Encoding: gzip`, REST Client will automatically decode the content and proceed with the message handling.
ja_jp: REST Client は、GZIP を使用した圧縮メッセージの受信もサポートしています。HTTP 圧縮のサポートを有効にするには、プロパティ `quarkus.http.enable-compression=true` を追加します。こ の機能が有効で、サーバがヘッダ `Content-Encoding: gzip` を含む応答を返すと、REST Client は自動的にコンテンツをデコードし、メッセージの処理を続行します。

source: REST Client also supports receiving multipart messages. As with sending, to parse a multipart response, you need to create a class that describes the response data, e.g.
ja_jp: REST Client は、マルチパートメッセージの受信もサポートしています。 送信と同様に、マルチパートレスポンスを解析するには、レスポンスデータを記述するクラスを作成する必要があります。以下に例を示します。

source: REST Client and RESTEasy interactions
ja_jp: REST クライアントと RESTEasy のやりとり

source: REST Client can log the requests it sends and the responses it receives. To enable logging, add the `quarkus.rest-client.logging.scope` property to your `application.properties` and set it to:
ja_jp: REST Client は、送信したリクエストと受信したレスポンスをログに記録できます。 ロギングを有効にするには、 `application.properties` に `quarkus.rest-client.logging.scope` プロパティを追加し、次のように設定します：

source: REST Client is logging the traffic with level DEBUG and does not alter logger properties. You may need to adjust your logger configuration to use this feature.
ja_jp: REST クライアントは、レベル DEBUG でトラフィックをロギングし、ロガー プロパティを変更しません。この機能を使用するには、ロガー設定を調整する必要があります。

source: REST Client must set a `Content-Type` for the `POST /orders` requests. When it sees `@Consumes` with multiple media type values, it sorts them and chooses the first media type as a `Content-Type` value. It must not impact the client code that makes calls such as `OrderService#addOrderReference` as all the listed `@Consumes` values are expected to be supported by the REST server.
ja_jp: REST Client は、`POST /orders` リクエストに `Content-Type` を設定する必要があります。複数のメディアタイプ値を持つ `@Consumes` を検出すると、それらをソートし、最初のメディアタイプを `Content-Type` の値として選択します。リストされているすべての `@Consumes` の値が REST サーバーでサポートされると予想されるため、`OrderService#addOrderReference` のような呼び出しを行うクライアントコードには影響を与えないはずです。

source: REST Client needs to know the classes used as multipart return types upfront. If you have an interface method that produces `multipart/form-data`, the return type will be discovered automatically. However, if you intend to use the `ClientBuilder` API to parse a response as multipart, you need to annotate your DTO class with `@MultipartForm`.
ja_jp: REST Client は、マルチパートの戻り値の型として使用されるクラスを事前に認識する必要があります。 `multipart/form-data` を生成するインターフェイスメソッドがある場合、戻り値の型は自動的に検出されます。ただし、 `ClientBuilder` API を使用して応答をマルチパートとして解析する場合は、DTO クラスに `@MultipartForm` のアノテーションを付ける必要があります。

source: REST Client supports sending requests through a proxy. It honors the JVM settings for it but also allows to specify both:
ja_jp: REST Client はプロキシ経由でのリクエスト送信をサポートしています。 JVMの設定を尊重しますが、両方を指定することもできます：

source: REST Client supports sending requests through a proxy. You can still rely on JVM proxy settings, but REST Client allows you to define a default proxy and any number of named proxy configurations that clients can reference.
ja_jp: REST Client はプロキシーを介したリクエストの送信をサポートしています。JVM のプロキシー設定に依存することもできますが、REST Client を使用すると、デフォルトのプロキシーと、クライアントが参照できる任意の数の名前付きプロキシー設定を定義できます。

source: REST Client uses a default `ClientLogger` implementation, which can be swapped out for a custom implementation.
ja_jp: REST Client はデフォルトの `ClientLogger` 実装を使用します。この実装は、カスタム実装に置き換えることができます。

source: REST Client: allows consuming HTTP endpoints. Under the hood, it uses the non-blocking I/O features from Quarkus.
ja_jp: RESTクライアント：HTTPエンドポイントを消費できます。 QuarkusのノンブロッキングI/O機能を使用しています。

source: REST Data with Panache generates JAX-RS resources based on the interfaces available in your application. For each entity and repository that you want to generate, provide a resource interface. _Do not implement these interfaces and don't provide custom methods because they will be ignored._ You can, however, override the methods from the extended interface in order to customize them (see the section at the end).
ja_jp: REST Data with Panache は、アプリケーションで利用可能なインターフェイスに基づいて JAX-RS リソースを生成します。生成したい各エンティティーとリポジトリに対して、リソースインターフェイスを提供してください。 _これらのインターフェイスを実装したり、カスタムメソッドを提供したりしないでください。_ ただし、拡張インターフェースからメソッドをオーバーライドしてカスタマイズすることは可能です(最後のセクションを参照してください)。

source: REST Data with Panache generates Jakarta REST resources based on the interfaces available in your application. For each entity and repository that you want to generate, provide a resource interface. _Do not implement these interfaces and don't provide custom methods because they will be ignored._ You can, however, override the methods from the extended interface in order to customize them (see the section at the end).
ja_jp: REST Data with Panacheは、アプリケーションに存在するインターフェースに基づいて、Jakarta RESTリソースを生成します。生成したい各エンティティとリポジトリに対して、リソース・インターフェースを提供します。 _これらのインターフェイスは実装せず、カスタムメソッドを提供しないようにしてください。_ ただし、カスタマイズするために、拡張インターフェースからメソッドをオーバーライドすることは可能です（末尾のセクションを参照）。

source: REST Data with Panache provides a `@ResourceProperties` and `@MethodProperties` annotations that can be used to customize certain features of the resource.
ja_jp: REST Data with Panacheは、リソースの特定の機能をカスタマイズするために使用できる `@ResourceProperties` 、 `@MethodProperties` アノテーションを提供します。

source: REST Data with Panache provides a `@ResourceProperties` and `@MethodProperties` annotations that can be used to customize certain features of the resource. It can be used in your resource interface:
ja_jp: REST Data with Panache は、リソースの特定の機能をカスタマイズするために使用できる `@ResourceProperties` と `@MethodProperties` のアノテーションを提供します。リソースのインターフェイスで使用することができます。

source: REST Data with Panache supports the following query parameters to get the list of entities:
ja_jp: REST Data with Panacheは、エンティティのリストを取得するために以下のクエリパラメータをサポートしています:

source: REST Data with Panache supports the following query parameters with the generated resources.
ja_jp: REST Data with Panacheは、生成されたリソースで以下のクエリパラメーターをサポートしています。

source: REST Data with Panache supports the subscription to the following resource method hooks:
ja_jp: REST Data with Panacheは、以下のリソースメソッドフックの購読をサポートします:

source: REST Data with Panache will use the Security annotations within the package `jakarta.annotation.security` that are defined on your resource interfaces:
ja_jp: REST Data with Panacheは、リソースインターフェースに定義されたパッケージ `jakarta.annotation.security` 内のSecurityアノテーションを使用します:

source: REST Data with Panache will use the Security annotations within the package `javax.annotation.security` that are defined on your resource interfaces:
ja_jp: REST Data with Panacheは、リソースインターフェースに定義された、パッケージ `javax.annotation.security` のSecurityアノテーションを使用します:

source: REST Endpoint V1
ja_jp: REST エンドポイント V1

source: REST Endpoint V2
ja_jp: REST エンドポイント V2

source: REST clients helped isolate services cleaner and better
ja_jp: RESTクライアントにより、サービスをよりきれいに、よりよく分離することができました

source: REST end point validation
ja_jp: RESTエンドポイントバリデーション

source: REST endpoint V1
ja_jp: REST エンドポイント V1

source: REST endpoint V2
ja_jp: REST エンドポイント V2

source: REST endpoints are automatically traced. If you need to trace additional methods, you can add the `org.eclipse.microprofile.opentracing.Traced` annotation to CDI bean classes or their non-private methods.
ja_jp: REST エンドポイントは自動的にトレースされます。追加でメソッドをトレースする必要がある場合は、CDI beanのクラスや非privateのメソッドに `org.eclipse.microprofile.opentracing.Traced` アノテーションを追加することができます。

source: REST framework implementing JAX-RS and more
ja_jp: JAX-RS などを実装する REST フレームワーク

source: REST over HTTP has become a very common way to write services over the past decade. While Funqy has an HTTP binding it is not a replacement for REST. Because Funqy has to work across a variety of protocols and function cloud platforms, it is very minimalistic and constrained. For example, if you use Funqy you lose the ability to link (think URIs) to the data your functions spit out. You also lose the ability to leverage cool HTTP features like `cache-control` and conditional GETs. Many developers will be ok with that as many won't be using these REST/HTTP features or styles. You'll have to make the decision on what camp you are in. Quarkus does support REST integration (through JAX-RS, Spring MVC, Vert.x Web, and Servlet) with various cloud/function providers, but there are some disadvantages of using that approach as well. For example, if you want to do xref:amazon-lambda-http.adoc[HTTP with AWS Lambda], this requires you to use the AWS API Gateway which may slow down deployment and cold start time or even cost you more.
ja_jp: REST over HTTPは、過去10年間で、サービスを書くための非常に一般的な方法となりました。 FunqyはHTTPバインディングを持っていますが、RESTの代替品ではありません。 Funqyは様々なプロトコルや機能クラウドプラットフォームで動作する必要があるため、非常にミニマルで制約の多いものとなっています。 例えば、Funqyを使うと、関数が吐き出すデータにリンクする（URIを考える）機能が失われます。また、 `cache-control` や条件付きGETのようなクールなHTTP機能を活用することもできなくなります。 多くの開発者は、このようなREST/HTTPの機能やスタイルを使用することはないでしょうから、それで構わないでしょう。自分がどのような立場にいるのか、判断する必要があります。 Quarkusでは、さまざまなクラウド／関数プロバイダーとのREST連携（JAX-RS、Spring MVC、Vert.x Web、Servletによる）をサポートしていますが、そのアプローチを使うことによるデメリットもあります。 例えば、 link:amazon-lambda-http.html[HTTPでAWS Lambda] を行いたい場合、AWS API Gatewayを利用する必要があり、 デプロイやコールドスタート時間が遅くなったり、コストがかかったりすることがあります。

source: REST over HTTP has become a very common way to write services over the past decade. While Funqy has an HTTP binding it is not a replacement for REST. Because Funqy has to work across a variety of protocols and function cloud platforms, it is very minimalistic and constrained. For example, if you use Funqy you lose the ability to link (think URIs) to the data your functions spit out. You also lose the ability to leverage cool HTTP features like `cache-control` and conditional GETs. Many developers will be ok with that as many won't be using these REST/HTTP features or styles. You'll have to make the decision on what camp you are in. Quarkus does support REST integration (through Jakarta REST, Spring MVC, Vert.x Web, and Servlet) with various cloud/function providers, but there are some disadvantages of using that approach as well. For example, if you want to do xref:aws-lambda-http.adoc[HTTP with AWS Lambda], this requires you to use the AWS API Gateway which may slow down deployment and cold start time or even cost you more.
ja_jp: REST over HTTPは、過去10年間でサービスを書くための非常に一般的な方法となりました。 FunqyはHTTPバインディングを持っていますが、RESTの代わりではありません。Funqyはさまざまなプロトコルや機能のクラウドプラットフォームで動作する必要があるため、非常にミニマルで制約があります。 例えば、Funqyを使うと、関数が吐き出すデータにリンクする（URIを考える）機能が失われます。また、 `cache-control` や条件付きGETのようなクールなHTTP機能を活用することもできなくなります。 多くの開発者はこのようなREST/HTTPの機能やスタイルを使用しないので、それで問題ないでしょう。自分がどの陣営に属するかを判断する必要があります。Quarkusは、（Jakarta REST、Spring MVC、Vert.x Web、Servletを通じて）様々なクラウド/ファンクションプロバイダーとのREST統合をサポートしていますが、そのアプローチを使うことにはデメリットもあります。例えば、 xref:aws-lambda-http.adoc[AWS LambdaでHTTP] を行いたい場合、AWS API Gatewayを使用する必要があり、デプロイやコールドスタート時間が遅くなったり、コストがかかったりする可能性があります。

source: REST server accepts OrderReference representations in either JSON or YAML formats.
ja_jp: REST サーバーは、OrderReference 表現を JSON または YAML 形式のいずれかで受け入れます。

source: REST-assured is used to test the function, `Hello World!` will be sent to it via the invoker.
ja_jp: REST-assuredは関数のテストに使用されます。 `Hello World!` はinvokerを介して送られます。

source: REST-assured is used to test the function, `{"data":"world"}` will be sent to it via the invoker.
ja_jp: REST-assuredは関数のテストに使用され、 `{"data":"world"}` が、invokerを介して送信されます。

source: REST-assured is used to test the function, `{"name":"hello.txt"}` will be sent to it via the invoker.
ja_jp: REST-assuredは関数のテストに使用されます。 `{"name":"hello.txt"}` はinvokerを介して送られます。

source: REST-assured is used to test the function, this payload that describe a storage event will be sent to it via the invoker.
ja_jp: REST-assuredは関数のテストに使用され、ストレージイベントを記述したこのペイロードがinvokerを介して送信されます。

source: RESTEasy Classic supports determining providers at build time using Java's Service Loader. In order to ensure that all providers are determined at build time, Quarkus REST does not support this feature. Instead, users that have providers in application dependencies are encouraged to index those dependencies using one of the methods described in the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide.
ja_jp: RESTEasy Classic は、すべてのプロバイダーがビルド時に決定されるように、Java のサービスローダーを使用してビルド時にプロバイダーを決定するサポートを提供します。 Quarkus REST はこの機能をサポートしていません。代わりに、アプリケーションの依存関係にプロバイダーを持つユーザーは、それらの依存関係をインデックス化することが推奨されます。 CDI ガイドの xref:cdi-reference.adoc#bean_discovery[Bean Discovery] セクションで説明されている方法のいずれかを使用します。

source: RESTEasy Classic supports determining providers at build time using Java's Service Loader. In order to ensure that all providers are determined at build time, RESTEasy Reactive does not support this feature. Instead, users that have providers in application dependencies are encouraged to index those dependencies using one of the methods described in the xref:cdi-reference.adoc#bean_discovery[Bean Discovery] section of the CDI guide.
ja_jp: RESTEasy Classicは、JavaのService Loaderを使用して、ビルド時にプロバイダを決定することをサポートしています。すべてのプロバイダがビルド時に決定されるようにするため、RESTEasy Reactive はこの機能をサポートしていません。代わりに、アプリケーションの依存関係にプロバイダがあるユーザは、CDI ガイドの link:cdi-reference.html#bean_discovery[Beanディスカバリー] セクションで説明されている方法のいずれかを使用して、これらの依存関係のインデックスを作成することが推奨されます。

source: RESTEasy Integration
ja_jp: RESTEasy 統合

source: RESTEasy Reactive - To block or not to block
ja_jp: RESTEasy Reactive - ブロックするか、しないべきか、それが問題だ

source: RESTEasy Reactive - we use it to expose our HTTP endpoint
ja_jp: RESTEasy Reactive - HTTPエンドポイントを公開するために使用しています。
